# Чтение и предворительный просмотр данных
# Выбор данных
# Простая статитсика
# Изображаем статистические отношения
# Линейные графики
# Гистограмма

# Знакомство с аналитикой. ИСпользование Google Colab
# Инструменты для работы с табличными данными - Pandas
# Способы визуализации данных - библиотеки matplotlib и seaborn
# Разведочный анализ данных - EDA (Exploratory Data Anallysis)
#  Он состоит в анализе основных данных, нпхождения в них общих закономерностей, распределений и аномалий, 
#  постороение начальных модулей, зачастую с использованием инструментов визуализации
# Понятие разводачный анализ данных было введено математиком ДЖОНОМ ТЬЮКИ, который сформулировал цули такого анализа следующим образом:
#   1. Максимальное "проникновение" в данные
#   2. Выявление основных структур
#   3. Выбор наиболее важных переменных
#   4. Обнаружение отклонений и аномалий
#   5. Проверка основных гипотиз

import pandas as pd

 